@switch($type)
    @case('adminCategory')
    <div class="modal fade" id="Modal" data-backdrop="static" tabindex="-1" role="dialog"
         aria-labelledby="staticBackdrop"
         aria-hidden="true">
        <div class="modal-dialog modal-md modal-dialog-centered" role="document">
            <div class="modal-content rounded-lg">
                <div class="modal-body text-center">
                    <svg xmlns="http://www.w3.org/2000/svg" width="151.959" height="69.648"
                         viewBox="0 0 151.959 69.648">
                        <g id="delete" transform="translate(-710 -348.911)">
                            <g id="Group_1628" data-name="Group 1628" transform="translate(710 356.912)">
                                <g id="Background">
                                    <path id="Path_9855" data-name="Path 9855"
                                          d="M852.109,406.012a4.925,4.925,0,1,1,4.925,4.925A4.925,4.925,0,0,1,852.109,406.012Zm-109.748,4.925a4.925,4.925,0,0,1,0-9.849H714.925a4.925,4.925,0,0,1,0-9.849h28.141a4.925,4.925,0,0,0,0-9.849H725.477a4.925,4.925,0,0,1,0-9.849h28.141a4.925,4.925,0,1,1,0-9.849h40.1a4.925,4.925,0,1,1,0,9.849h45.025a4.925,4.925,0,1,1,0,9.849H854.22a4.925,4.925,0,1,1,0,9.849H840.853a4.925,4.925,0,1,0,0,9.849h4.221a4.925,4.925,0,0,1,0,9.849Z"
                                          transform="translate(-710 -361.691)" fill="#f3f7ff"/>
                                </g>
                                <g id="Oval-2" transform="translate(114.672 42.211)">
                                    <circle id="Ellipse_714" data-name="Ellipse 714" cx="2.111" cy="2.111" r="2.111"
                                            fill="#e1ebff"/>
                                </g>
                                <g id="Line_4" data-name="Line 4" transform="translate(17.295 7.599)">
                                    <path id="Path_9858" data-name="Path 9858"
                                          d="M749.255,414.017a.876.876,0,0,1-.622-.257l-1.489-1.489-1.489,1.489a.879.879,0,0,1-1.244-1.244l1.489-1.489-1.489-1.489a.879.879,0,0,1,1.244-1.244l1.489,1.489,1.489-1.489a.879.879,0,0,1,1.244,1.244l-1.489,1.489,1.489,1.489a.879.879,0,0,1-.622,1.5Z"
                                          transform="translate(-744.154 -408.037)" fill="#2e84ff"/>
                                </g>
                                <g id="Oval-3" transform="translate(127.336 4.925)">
                                    <circle id="Ellipse_715" data-name="Ellipse 715" cx="2.111" cy="2.111" r="2.111"
                                            fill="#e1ebff"/>
                                </g>
                            </g>
                            <g id="Shape-2" transform="translate(768.378 373.667)">
                                <path id="Path_9877" data-name="Path 9877"
                                      d="M822.132,386.218a3.968,3.968,0,1,1,3.968,3.968A3.968,3.968,0,0,1,822.132,386.218Zm-12.566,0a3.968,3.968,0,1,1,3.968,3.968A3.968,3.968,0,0,1,809.566,386.218Zm-12.566,0a3.968,3.968,0,1,1,3.968,3.968A3.968,3.968,0,0,1,797,386.218Z"
                                      transform="translate(-796.173 -381.423)" fill="#e1ebff"/>
                                <path id="Path_9878" data-name="Path 9878"
                                      d="M825.677,390.59a4.795,4.795,0,1,1,4.795-4.8A4.8,4.8,0,0,1,825.677,390.59Zm0-7.937a3.142,3.142,0,1,0,3.141,3.142A3.145,3.145,0,0,0,825.677,382.653Zm-12.566,7.937a4.795,4.795,0,1,1,4.795-4.8A4.8,4.8,0,0,1,813.111,390.59Zm0-7.937a3.142,3.142,0,1,0,3.142,3.142A3.145,3.145,0,0,0,813.111,382.653Zm-12.566,7.937a4.795,4.795,0,1,1,4.795-4.8A4.8,4.8,0,0,1,800.545,390.59Zm0-7.937a3.142,3.142,0,1,0,3.142,3.142A3.145,3.145,0,0,0,800.545,382.653Z"
                                      transform="translate(-795.75 -381)" fill="#3f9eff"/>
                            </g>
                            <g id="Line" transform="translate(757.341 367.92)">
                                <path id="Path_9879" data-name="Path 9879"
                                      d="M779.889,377.113a.827.827,0,0,1-.767-1.134,23.572,23.572,0,0,1,1.61-3.263.827.827,0,0,1,1.422.844,22.014,22.014,0,0,0-1.5,3.034A.826.826,0,0,1,779.889,377.113Z"
                                      transform="translate(-779.062 -372.311)" fill="#3f9eff"/>
                            </g>
                            <g id="Line-2" transform="translate(760.401 356.219)">
                                <path id="Path_9880" data-name="Path 9880"
                                      d="M784.515,366.223a.827.827,0,0,1-.653-1.333,29.746,29.746,0,0,1,10.943-8.74.827.827,0,0,1,.7,1.5A28.078,28.078,0,0,0,785.17,365.9.826.826,0,0,1,784.515,366.223Z"
                                      transform="translate(-783.689 -356.073)" fill="#3f9eff"/>
                            </g>
                            <g id="unsuccessful-payment" transform="translate(752.862 348.911)">
                                <g id="Shape">
                                    <path id="Path_9906" data-name="Path 9906"
                                          d="M755.867,342.316a24.01,24.01,0,0,1-3.608,2.873l4.636-3.939C756.582,341.6,756.235,341.959,755.867,342.316Zm2.782-3.092h0l-8.63,7.225a29.414,29.414,0,0,1-11.57,3.569,29.991,29.991,0,0,1-14.139-2.1,29.685,29.685,0,0,1-10.116-6.876,30.019,30.019,0,0,1-4.661-6.283,29.694,29.694,0,0,1,41.782-39.538,30.191,30.191,0,0,1,8.716,8.362A29.662,29.662,0,0,1,758.649,339.224Z"
                                          transform="translate(-705.036 -289.88)" fill="#fff"/>
                                    <path id="Path_9907" data-name="Path 9907"
                                          d="M735.217,350.441a30.9,30.9,0,0,1-11.671-2.29,30.263,30.263,0,0,1-10.381-7.055,30.48,30.48,0,0,1,7.082-47.868,30.466,30.466,0,0,1,31.009.856,30.6,30.6,0,0,1,7.522,45.151,37.849,37.849,0,0,1-8.855,7.412,30,30,0,0,1-11.874,3.662C737.108,350.4,736.162,350.441,735.217,350.441Zm-.189-59.492A28.922,28.922,0,0,0,709.739,333.9a29.241,29.241,0,0,0,4.54,6.121,28.731,28.731,0,0,0,9.854,6.7,29.331,29.331,0,0,0,13.773,2.049,28.467,28.467,0,0,0,11.2-3.439s2.806-1.874,4.935-3.656a33.909,33.909,0,0,0,3.582-3.473,29.047,29.047,0,0,0-22.6-47.252Z"
                                          transform="translate(-704.566 -289.403)" fill="#2e84ff"/>
                                </g>
                                <path id="Path_9908" data-name="Path 9908"
                                      d="M800.8,281.725v3.712a.773.773,0,1,1-1.547,0v-3.712"
                                      transform="translate(-714.702 -257.623)" fill="#2e84ff"/>
                                <g id="Line-2-2" data-name="Line-2" transform="translate(84.548 31.991)">
                                    <path id="Path_9909" data-name="Path 9909"
                                          d="M800.023,299.734a.773.773,0,0,1-.773-.773v-3.712a.773.773,0,0,1,1.547,0v3.712A.773.773,0,0,1,800.023,299.734Z"
                                          transform="translate(-799.25 -294.475)" fill="#2e84ff"/>
                                </g>
                                <g id="Line-3" transform="translate(78.361 29.516)">
                                    <path id="Path_9910" data-name="Path 9910"
                                          d="M793.736,292.022h-3.712a.773.773,0,0,1,0-1.547h3.712a.773.773,0,1,1,0,1.547Z"
                                          transform="translate(-789.25 -290.475)" fill="#2e84ff"/>
                                </g>
                                <g id="Line-4" transform="translate(87.023 29.516)">
                                    <path id="Path_9911" data-name="Path 9911"
                                          d="M807.736,292.022h-3.712a.773.773,0,1,1,0-1.547h3.712a.773.773,0,1,1,0,1.547Z"
                                          transform="translate(-803.25 -290.475)" fill="#2e84ff"/>
                                </g>
                                <g id="bling-2" transform="translate(2.279 58.202)">
                                    <g id="Line-5" transform="translate(4.95)">
                                        <path id="Path_9912" data-name="Path 9912"
                                              d="M717.023,387.5a.773.773,0,0,1-.773-.773v-2.475a.773.773,0,1,1,1.547,0v2.475A.773.773,0,0,1,717.023,387.5Z"
                                              transform="translate(-716.25 -383.475)" fill="#2e84ff"/>
                                    </g>
                                    <g id="Line-6" transform="translate(4.95 7.424)">
                                        <path id="Path_9913" data-name="Path 9913"
                                              d="M717.023,399.5a.773.773,0,0,1-.773-.773v-2.475a.773.773,0,1,1,1.547,0v2.475A.773.773,0,0,1,717.023,399.5Z"
                                              transform="translate(-716.25 -395.475)" fill="#2e84ff"/>
                                    </g>
                                    <g id="Line-7" transform="translate(0 4.95)">
                                        <path id="Path_9914" data-name="Path 9914"
                                              d="M711.5,393.022h-2.475a.773.773,0,1,1,0-1.547H711.5a.773.773,0,0,1,0,1.547Z"
                                              transform="translate(-708.25 -391.475)" fill="#2e84ff"/>
                                    </g>
                                    <g id="Line-8" transform="translate(7.424 4.95)">
                                        <path id="Path_9915" data-name="Path 9915"
                                              d="M723.5,393.022h-2.475a.773.773,0,0,1,0-1.547H723.5a.773.773,0,0,1,0,1.547Z"
                                              transform="translate(-720.25 -391.475)" fill="#2e84ff"/>
                                    </g>
                                </g>
                                <g id="Shape-2-2" data-name="Shape-2" transform="translate(9.913 5.419)">
                                    <path id="Path_9916" data-name="Path 9916"
                                          d="M732.563,299.413a25.8,25.8,0,0,0-8.88,5.626,26.168,26.168,0,0,0-1.845,1.977"
                                          transform="translate(-721.065 -298.639)" fill="#fff"/>
                                    <path id="Path_9917" data-name="Path 9917"
                                          d="M721.361,307.313a.774.774,0,0,1-.591-1.271,27.056,27.056,0,0,1,1.9-2.036,26.422,26.422,0,0,1,9.144-5.793.773.773,0,0,1,.545,1.448,24.893,24.893,0,0,0-8.614,5.457,25.464,25.464,0,0,0-1.792,1.92A.772.772,0,0,1,721.361,307.313Z"
                                          transform="translate(-720.588 -298.162)" fill="#2e84ff"/>
                                </g>
                                <g id="Union_3" data-name="Union 3" transform="translate(20.464 20.857)">
                                    <path id="Path_9918" data-name="Path 9918"
                                          d="M753.755,341.9l-5.943-5.944-5.943,5.944a1.891,1.891,0,0,1-2.674-2.675l5.94-5.943-5.94-5.943a1.891,1.891,0,1,1,2.674-2.675l5.943,5.943,5.943-5.943a1.891,1.891,0,0,1,2.674,0h0a1.891,1.891,0,0,1,0,2.674h0l-5.943,5.944,5.943,5.944a1.891,1.891,0,0,1,0,2.674h0a1.883,1.883,0,0,1-2.675,0Z"
                                          transform="translate(-738.023 -323.495)" fill="#e1ebff"/>
                                    <path id="Path_9919" data-name="Path 9919"
                                          d="M754.711,342.7a2.519,2.519,0,0,1-1.776-.741l-5.5-5.505-5.506,5.506a2.51,2.51,0,0,1-3.549-3.55l5.5-5.505-5.5-5.505a2.51,2.51,0,0,1,3.548-3.551l5.506,5.506,5.506-5.506a2.491,2.491,0,0,1,1.774-.736h0a2.51,2.51,0,0,1,1.776,4.284l-5.506,5.507,5.506,5.506a2.513,2.513,0,0,1-1.775,4.288Zm-7.28-8,6.383,6.383a1.3,1.3,0,0,0,1.8,0,1.272,1.272,0,0,0,0-1.8l-6.381-6.381,6.381-6.381a1.273,1.273,0,0,0-.9-2.173h0a1.264,1.264,0,0,0-.9.373l-6.381,6.381-6.381-6.381a1.273,1.273,0,0,0-1.8,1.8l6.377,6.38-6.376,6.38a1.272,1.272,0,1,0,1.8,1.8Z"
                                          transform="translate(-737.642 -323.114)" fill="#2e84ff"/>
                                </g>
                            </g>
                        </g>
                    </svg>
                    <p class="fs-3 mt-10 mb-0">آیا از حذف دسته بندی اطمینان دارید؟</p>
                </div>
                <div class="modal-footer justify-content-center border-0 pt-0 mt-0">

                    <button type="button" class="btn btn-secondary rounded-lg" data-bs-dismiss="modal">انصراف</button>
                    <a class="btn btn-danger rounded-lg" href="{{ route('admin.categories.destroy', $model) }}"
                       onclick="event.preventDefault();
                           document.getElementById('DeleteForm{{ $model }}').submit();"> حذف دسته بندی
                    </a>
                    <form method="post" id="DeleteForm{{ $model }}"
                          action="{{ route('admin.categories.destroy', $model) }}"
                          class="d-none">
                        @csrf
                        <input type="hidden" name="_method" value="DELETE">
                    </form>
                </div>
            </div>
        </div>
    </div>
    @break
    @case('adminRole')
    <div class="modal fade" id="Modal" data-backdrop="static" tabindex="-1" role="dialog"
         aria-labelledby="staticBackdrop"
         aria-hidden="true">
        <div class="modal-dialog modal-md modal-dialog-centered" role="document">
            <div class="modal-content rounded-lg">
                <div class="modal-body text-center">
                    <svg xmlns="http://www.w3.org/2000/svg" width="151.959" height="69.648"
                         viewBox="0 0 151.959 69.648">
                        <g id="delete" transform="translate(-710 -348.911)">
                            <g id="Group_1628" data-name="Group 1628" transform="translate(710 356.912)">
                                <g id="Background">
                                    <path id="Path_9855" data-name="Path 9855"
                                          d="M852.109,406.012a4.925,4.925,0,1,1,4.925,4.925A4.925,4.925,0,0,1,852.109,406.012Zm-109.748,4.925a4.925,4.925,0,0,1,0-9.849H714.925a4.925,4.925,0,0,1,0-9.849h28.141a4.925,4.925,0,0,0,0-9.849H725.477a4.925,4.925,0,0,1,0-9.849h28.141a4.925,4.925,0,1,1,0-9.849h40.1a4.925,4.925,0,1,1,0,9.849h45.025a4.925,4.925,0,1,1,0,9.849H854.22a4.925,4.925,0,1,1,0,9.849H840.853a4.925,4.925,0,1,0,0,9.849h4.221a4.925,4.925,0,0,1,0,9.849Z"
                                          transform="translate(-710 -361.691)" fill="#f3f7ff"/>
                                </g>
                                <g id="Oval-2" transform="translate(114.672 42.211)">
                                    <circle id="Ellipse_714" data-name="Ellipse 714" cx="2.111" cy="2.111" r="2.111"
                                            fill="#e1ebff"/>
                                </g>
                                <g id="Line_4" data-name="Line 4" transform="translate(17.295 7.599)">
                                    <path id="Path_9858" data-name="Path 9858"
                                          d="M749.255,414.017a.876.876,0,0,1-.622-.257l-1.489-1.489-1.489,1.489a.879.879,0,0,1-1.244-1.244l1.489-1.489-1.489-1.489a.879.879,0,0,1,1.244-1.244l1.489,1.489,1.489-1.489a.879.879,0,0,1,1.244,1.244l-1.489,1.489,1.489,1.489a.879.879,0,0,1-.622,1.5Z"
                                          transform="translate(-744.154 -408.037)" fill="#2e84ff"/>
                                </g>
                                <g id="Oval-3" transform="translate(127.336 4.925)">
                                    <circle id="Ellipse_715" data-name="Ellipse 715" cx="2.111" cy="2.111" r="2.111"
                                            fill="#e1ebff"/>
                                </g>
                            </g>
                            <g id="Shape-2" transform="translate(768.378 373.667)">
                                <path id="Path_9877" data-name="Path 9877"
                                      d="M822.132,386.218a3.968,3.968,0,1,1,3.968,3.968A3.968,3.968,0,0,1,822.132,386.218Zm-12.566,0a3.968,3.968,0,1,1,3.968,3.968A3.968,3.968,0,0,1,809.566,386.218Zm-12.566,0a3.968,3.968,0,1,1,3.968,3.968A3.968,3.968,0,0,1,797,386.218Z"
                                      transform="translate(-796.173 -381.423)" fill="#e1ebff"/>
                                <path id="Path_9878" data-name="Path 9878"
                                      d="M825.677,390.59a4.795,4.795,0,1,1,4.795-4.8A4.8,4.8,0,0,1,825.677,390.59Zm0-7.937a3.142,3.142,0,1,0,3.141,3.142A3.145,3.145,0,0,0,825.677,382.653Zm-12.566,7.937a4.795,4.795,0,1,1,4.795-4.8A4.8,4.8,0,0,1,813.111,390.59Zm0-7.937a3.142,3.142,0,1,0,3.142,3.142A3.145,3.145,0,0,0,813.111,382.653Zm-12.566,7.937a4.795,4.795,0,1,1,4.795-4.8A4.8,4.8,0,0,1,800.545,390.59Zm0-7.937a3.142,3.142,0,1,0,3.142,3.142A3.145,3.145,0,0,0,800.545,382.653Z"
                                      transform="translate(-795.75 -381)" fill="#3f9eff"/>
                            </g>
                            <g id="Line" transform="translate(757.341 367.92)">
                                <path id="Path_9879" data-name="Path 9879"
                                      d="M779.889,377.113a.827.827,0,0,1-.767-1.134,23.572,23.572,0,0,1,1.61-3.263.827.827,0,0,1,1.422.844,22.014,22.014,0,0,0-1.5,3.034A.826.826,0,0,1,779.889,377.113Z"
                                      transform="translate(-779.062 -372.311)" fill="#3f9eff"/>
                            </g>
                            <g id="Line-2" transform="translate(760.401 356.219)">
                                <path id="Path_9880" data-name="Path 9880"
                                      d="M784.515,366.223a.827.827,0,0,1-.653-1.333,29.746,29.746,0,0,1,10.943-8.74.827.827,0,0,1,.7,1.5A28.078,28.078,0,0,0,785.17,365.9.826.826,0,0,1,784.515,366.223Z"
                                      transform="translate(-783.689 -356.073)" fill="#3f9eff"/>
                            </g>
                            <g id="unsuccessful-payment" transform="translate(752.862 348.911)">
                                <g id="Shape">
                                    <path id="Path_9906" data-name="Path 9906"
                                          d="M755.867,342.316a24.01,24.01,0,0,1-3.608,2.873l4.636-3.939C756.582,341.6,756.235,341.959,755.867,342.316Zm2.782-3.092h0l-8.63,7.225a29.414,29.414,0,0,1-11.57,3.569,29.991,29.991,0,0,1-14.139-2.1,29.685,29.685,0,0,1-10.116-6.876,30.019,30.019,0,0,1-4.661-6.283,29.694,29.694,0,0,1,41.782-39.538,30.191,30.191,0,0,1,8.716,8.362A29.662,29.662,0,0,1,758.649,339.224Z"
                                          transform="translate(-705.036 -289.88)" fill="#fff"/>
                                    <path id="Path_9907" data-name="Path 9907"
                                          d="M735.217,350.441a30.9,30.9,0,0,1-11.671-2.29,30.263,30.263,0,0,1-10.381-7.055,30.48,30.48,0,0,1,7.082-47.868,30.466,30.466,0,0,1,31.009.856,30.6,30.6,0,0,1,7.522,45.151,37.849,37.849,0,0,1-8.855,7.412,30,30,0,0,1-11.874,3.662C737.108,350.4,736.162,350.441,735.217,350.441Zm-.189-59.492A28.922,28.922,0,0,0,709.739,333.9a29.241,29.241,0,0,0,4.54,6.121,28.731,28.731,0,0,0,9.854,6.7,29.331,29.331,0,0,0,13.773,2.049,28.467,28.467,0,0,0,11.2-3.439s2.806-1.874,4.935-3.656a33.909,33.909,0,0,0,3.582-3.473,29.047,29.047,0,0,0-22.6-47.252Z"
                                          transform="translate(-704.566 -289.403)" fill="#2e84ff"/>
                                </g>
                                <path id="Path_9908" data-name="Path 9908"
                                      d="M800.8,281.725v3.712a.773.773,0,1,1-1.547,0v-3.712"
                                      transform="translate(-714.702 -257.623)" fill="#2e84ff"/>
                                <g id="Line-2-2" data-name="Line-2" transform="translate(84.548 31.991)">
                                    <path id="Path_9909" data-name="Path 9909"
                                          d="M800.023,299.734a.773.773,0,0,1-.773-.773v-3.712a.773.773,0,0,1,1.547,0v3.712A.773.773,0,0,1,800.023,299.734Z"
                                          transform="translate(-799.25 -294.475)" fill="#2e84ff"/>
                                </g>
                                <g id="Line-3" transform="translate(78.361 29.516)">
                                    <path id="Path_9910" data-name="Path 9910"
                                          d="M793.736,292.022h-3.712a.773.773,0,0,1,0-1.547h3.712a.773.773,0,1,1,0,1.547Z"
                                          transform="translate(-789.25 -290.475)" fill="#2e84ff"/>
                                </g>
                                <g id="Line-4" transform="translate(87.023 29.516)">
                                    <path id="Path_9911" data-name="Path 9911"
                                          d="M807.736,292.022h-3.712a.773.773,0,1,1,0-1.547h3.712a.773.773,0,1,1,0,1.547Z"
                                          transform="translate(-803.25 -290.475)" fill="#2e84ff"/>
                                </g>
                                <g id="bling-2" transform="translate(2.279 58.202)">
                                    <g id="Line-5" transform="translate(4.95)">
                                        <path id="Path_9912" data-name="Path 9912"
                                              d="M717.023,387.5a.773.773,0,0,1-.773-.773v-2.475a.773.773,0,1,1,1.547,0v2.475A.773.773,0,0,1,717.023,387.5Z"
                                              transform="translate(-716.25 -383.475)" fill="#2e84ff"/>
                                    </g>
                                    <g id="Line-6" transform="translate(4.95 7.424)">
                                        <path id="Path_9913" data-name="Path 9913"
                                              d="M717.023,399.5a.773.773,0,0,1-.773-.773v-2.475a.773.773,0,1,1,1.547,0v2.475A.773.773,0,0,1,717.023,399.5Z"
                                              transform="translate(-716.25 -395.475)" fill="#2e84ff"/>
                                    </g>
                                    <g id="Line-7" transform="translate(0 4.95)">
                                        <path id="Path_9914" data-name="Path 9914"
                                              d="M711.5,393.022h-2.475a.773.773,0,1,1,0-1.547H711.5a.773.773,0,0,1,0,1.547Z"
                                              transform="translate(-708.25 -391.475)" fill="#2e84ff"/>
                                    </g>
                                    <g id="Line-8" transform="translate(7.424 4.95)">
                                        <path id="Path_9915" data-name="Path 9915"
                                              d="M723.5,393.022h-2.475a.773.773,0,0,1,0-1.547H723.5a.773.773,0,0,1,0,1.547Z"
                                              transform="translate(-720.25 -391.475)" fill="#2e84ff"/>
                                    </g>
                                </g>
                                <g id="Shape-2-2" data-name="Shape-2" transform="translate(9.913 5.419)">
                                    <path id="Path_9916" data-name="Path 9916"
                                          d="M732.563,299.413a25.8,25.8,0,0,0-8.88,5.626,26.168,26.168,0,0,0-1.845,1.977"
                                          transform="translate(-721.065 -298.639)" fill="#fff"/>
                                    <path id="Path_9917" data-name="Path 9917"
                                          d="M721.361,307.313a.774.774,0,0,1-.591-1.271,27.056,27.056,0,0,1,1.9-2.036,26.422,26.422,0,0,1,9.144-5.793.773.773,0,0,1,.545,1.448,24.893,24.893,0,0,0-8.614,5.457,25.464,25.464,0,0,0-1.792,1.92A.772.772,0,0,1,721.361,307.313Z"
                                          transform="translate(-720.588 -298.162)" fill="#2e84ff"/>
                                </g>
                                <g id="Union_3" data-name="Union 3" transform="translate(20.464 20.857)">
                                    <path id="Path_9918" data-name="Path 9918"
                                          d="M753.755,341.9l-5.943-5.944-5.943,5.944a1.891,1.891,0,0,1-2.674-2.675l5.94-5.943-5.94-5.943a1.891,1.891,0,1,1,2.674-2.675l5.943,5.943,5.943-5.943a1.891,1.891,0,0,1,2.674,0h0a1.891,1.891,0,0,1,0,2.674h0l-5.943,5.944,5.943,5.944a1.891,1.891,0,0,1,0,2.674h0a1.883,1.883,0,0,1-2.675,0Z"
                                          transform="translate(-738.023 -323.495)" fill="#e1ebff"/>
                                    <path id="Path_9919" data-name="Path 9919"
                                          d="M754.711,342.7a2.519,2.519,0,0,1-1.776-.741l-5.5-5.505-5.506,5.506a2.51,2.51,0,0,1-3.549-3.55l5.5-5.505-5.5-5.505a2.51,2.51,0,0,1,3.548-3.551l5.506,5.506,5.506-5.506a2.491,2.491,0,0,1,1.774-.736h0a2.51,2.51,0,0,1,1.776,4.284l-5.506,5.507,5.506,5.506a2.513,2.513,0,0,1-1.775,4.288Zm-7.28-8,6.383,6.383a1.3,1.3,0,0,0,1.8,0,1.272,1.272,0,0,0,0-1.8l-6.381-6.381,6.381-6.381a1.273,1.273,0,0,0-.9-2.173h0a1.264,1.264,0,0,0-.9.373l-6.381,6.381-6.381-6.381a1.273,1.273,0,0,0-1.8,1.8l6.377,6.38-6.376,6.38a1.272,1.272,0,1,0,1.8,1.8Z"
                                          transform="translate(-737.642 -323.114)" fill="#2e84ff"/>
                                </g>
                            </g>
                        </g>
                    </svg>
                    <p class="fs-3 mt-10 mb-0">آیا از حذف نقش اطمینان دارید؟</p>
                </div>
                <div class="modal-footer justify-content-center border-0 pt-0 mt-0">

                    <button type="button" class="btn btn-secondary rounded-lg" data-bs-dismiss="modal">انصراف</button>
                    <a class="btn btn-danger rounded-lg" href="{{ route('admin.roles.destroy', $model) }}"
                       onclick="event.preventDefault();
                           document.getElementById('DeleteForm{{ $model }}').submit();"> حذف نقش
                    </a>
                    <form method="post" id="DeleteForm{{ $model }}" action="{{ route('admin.roles.destroy', $model) }}"
                          class="d-none">
                        @csrf
                        <input type="hidden" name="_method" value="DELETE">
                    </form>
                </div>
            </div>
        </div>
    </div>
    @break
    @case('adminPermission')
    <div class="modal fade" id="Modal" data-backdrop="static" tabindex="-1" role="dialog"
         aria-labelledby="staticBackdrop"
         aria-hidden="true">
        <div class="modal-dialog modal-dialog-centered" role="document">
            <div class="modal-content rounded-lg">
                <div class="modal-body text-center">
                    <svg xmlns="http://www.w3.org/2000/svg" width="151.959" height="69.648"
                         viewBox="0 0 151.959 69.648">
                        <g id="delete" transform="translate(-710 -348.911)">
                            <g id="Group_1628" data-name="Group 1628" transform="translate(710 356.912)">
                                <g id="Background">
                                    <path id="Path_9855" data-name="Path 9855"
                                          d="M852.109,406.012a4.925,4.925,0,1,1,4.925,4.925A4.925,4.925,0,0,1,852.109,406.012Zm-109.748,4.925a4.925,4.925,0,0,1,0-9.849H714.925a4.925,4.925,0,0,1,0-9.849h28.141a4.925,4.925,0,0,0,0-9.849H725.477a4.925,4.925,0,0,1,0-9.849h28.141a4.925,4.925,0,1,1,0-9.849h40.1a4.925,4.925,0,1,1,0,9.849h45.025a4.925,4.925,0,1,1,0,9.849H854.22a4.925,4.925,0,1,1,0,9.849H840.853a4.925,4.925,0,1,0,0,9.849h4.221a4.925,4.925,0,0,1,0,9.849Z"
                                          transform="translate(-710 -361.691)" fill="#f3f7ff"/>
                                </g>
                                <g id="Oval-2" transform="translate(114.672 42.211)">
                                    <circle id="Ellipse_714" data-name="Ellipse 714" cx="2.111" cy="2.111" r="2.111"
                                            fill="#e1ebff"/>
                                </g>
                                <g id="Line_4" data-name="Line 4" transform="translate(17.295 7.599)">
                                    <path id="Path_9858" data-name="Path 9858"
                                          d="M749.255,414.017a.876.876,0,0,1-.622-.257l-1.489-1.489-1.489,1.489a.879.879,0,0,1-1.244-1.244l1.489-1.489-1.489-1.489a.879.879,0,0,1,1.244-1.244l1.489,1.489,1.489-1.489a.879.879,0,0,1,1.244,1.244l-1.489,1.489,1.489,1.489a.879.879,0,0,1-.622,1.5Z"
                                          transform="translate(-744.154 -408.037)" fill="#2e84ff"/>
                                </g>
                                <g id="Oval-3" transform="translate(127.336 4.925)">
                                    <circle id="Ellipse_715" data-name="Ellipse 715" cx="2.111" cy="2.111" r="2.111"
                                            fill="#e1ebff"/>
                                </g>
                            </g>
                            <g id="Shape-2" transform="translate(768.378 373.667)">
                                <path id="Path_9877" data-name="Path 9877"
                                      d="M822.132,386.218a3.968,3.968,0,1,1,3.968,3.968A3.968,3.968,0,0,1,822.132,386.218Zm-12.566,0a3.968,3.968,0,1,1,3.968,3.968A3.968,3.968,0,0,1,809.566,386.218Zm-12.566,0a3.968,3.968,0,1,1,3.968,3.968A3.968,3.968,0,0,1,797,386.218Z"
                                      transform="translate(-796.173 -381.423)" fill="#e1ebff"/>
                                <path id="Path_9878" data-name="Path 9878"
                                      d="M825.677,390.59a4.795,4.795,0,1,1,4.795-4.8A4.8,4.8,0,0,1,825.677,390.59Zm0-7.937a3.142,3.142,0,1,0,3.141,3.142A3.145,3.145,0,0,0,825.677,382.653Zm-12.566,7.937a4.795,4.795,0,1,1,4.795-4.8A4.8,4.8,0,0,1,813.111,390.59Zm0-7.937a3.142,3.142,0,1,0,3.142,3.142A3.145,3.145,0,0,0,813.111,382.653Zm-12.566,7.937a4.795,4.795,0,1,1,4.795-4.8A4.8,4.8,0,0,1,800.545,390.59Zm0-7.937a3.142,3.142,0,1,0,3.142,3.142A3.145,3.145,0,0,0,800.545,382.653Z"
                                      transform="translate(-795.75 -381)" fill="#3f9eff"/>
                            </g>
                            <g id="Line" transform="translate(757.341 367.92)">
                                <path id="Path_9879" data-name="Path 9879"
                                      d="M779.889,377.113a.827.827,0,0,1-.767-1.134,23.572,23.572,0,0,1,1.61-3.263.827.827,0,0,1,1.422.844,22.014,22.014,0,0,0-1.5,3.034A.826.826,0,0,1,779.889,377.113Z"
                                      transform="translate(-779.062 -372.311)" fill="#3f9eff"/>
                            </g>
                            <g id="Line-2" transform="translate(760.401 356.219)">
                                <path id="Path_9880" data-name="Path 9880"
                                      d="M784.515,366.223a.827.827,0,0,1-.653-1.333,29.746,29.746,0,0,1,10.943-8.74.827.827,0,0,1,.7,1.5A28.078,28.078,0,0,0,785.17,365.9.826.826,0,0,1,784.515,366.223Z"
                                      transform="translate(-783.689 -356.073)" fill="#3f9eff"/>
                            </g>
                            <g id="unsuccessful-payment" transform="translate(752.862 348.911)">
                                <g id="Shape">
                                    <path id="Path_9906" data-name="Path 9906"
                                          d="M755.867,342.316a24.01,24.01,0,0,1-3.608,2.873l4.636-3.939C756.582,341.6,756.235,341.959,755.867,342.316Zm2.782-3.092h0l-8.63,7.225a29.414,29.414,0,0,1-11.57,3.569,29.991,29.991,0,0,1-14.139-2.1,29.685,29.685,0,0,1-10.116-6.876,30.019,30.019,0,0,1-4.661-6.283,29.694,29.694,0,0,1,41.782-39.538,30.191,30.191,0,0,1,8.716,8.362A29.662,29.662,0,0,1,758.649,339.224Z"
                                          transform="translate(-705.036 -289.88)" fill="#fff"/>
                                    <path id="Path_9907" data-name="Path 9907"
                                          d="M735.217,350.441a30.9,30.9,0,0,1-11.671-2.29,30.263,30.263,0,0,1-10.381-7.055,30.48,30.48,0,0,1,7.082-47.868,30.466,30.466,0,0,1,31.009.856,30.6,30.6,0,0,1,7.522,45.151,37.849,37.849,0,0,1-8.855,7.412,30,30,0,0,1-11.874,3.662C737.108,350.4,736.162,350.441,735.217,350.441Zm-.189-59.492A28.922,28.922,0,0,0,709.739,333.9a29.241,29.241,0,0,0,4.54,6.121,28.731,28.731,0,0,0,9.854,6.7,29.331,29.331,0,0,0,13.773,2.049,28.467,28.467,0,0,0,11.2-3.439s2.806-1.874,4.935-3.656a33.909,33.909,0,0,0,3.582-3.473,29.047,29.047,0,0,0-22.6-47.252Z"
                                          transform="translate(-704.566 -289.403)" fill="#2e84ff"/>
                                </g>
                                <path id="Path_9908" data-name="Path 9908"
                                      d="M800.8,281.725v3.712a.773.773,0,1,1-1.547,0v-3.712"
                                      transform="translate(-714.702 -257.623)" fill="#2e84ff"/>
                                <g id="Line-2-2" data-name="Line-2" transform="translate(84.548 31.991)">
                                    <path id="Path_9909" data-name="Path 9909"
                                          d="M800.023,299.734a.773.773,0,0,1-.773-.773v-3.712a.773.773,0,0,1,1.547,0v3.712A.773.773,0,0,1,800.023,299.734Z"
                                          transform="translate(-799.25 -294.475)" fill="#2e84ff"/>
                                </g>
                                <g id="Line-3" transform="translate(78.361 29.516)">
                                    <path id="Path_9910" data-name="Path 9910"
                                          d="M793.736,292.022h-3.712a.773.773,0,0,1,0-1.547h3.712a.773.773,0,1,1,0,1.547Z"
                                          transform="translate(-789.25 -290.475)" fill="#2e84ff"/>
                                </g>
                                <g id="Line-4" transform="translate(87.023 29.516)">
                                    <path id="Path_9911" data-name="Path 9911"
                                          d="M807.736,292.022h-3.712a.773.773,0,1,1,0-1.547h3.712a.773.773,0,1,1,0,1.547Z"
                                          transform="translate(-803.25 -290.475)" fill="#2e84ff"/>
                                </g>
                                <g id="bling-2" transform="translate(2.279 58.202)">
                                    <g id="Line-5" transform="translate(4.95)">
                                        <path id="Path_9912" data-name="Path 9912"
                                              d="M717.023,387.5a.773.773,0,0,1-.773-.773v-2.475a.773.773,0,1,1,1.547,0v2.475A.773.773,0,0,1,717.023,387.5Z"
                                              transform="translate(-716.25 -383.475)" fill="#2e84ff"/>
                                    </g>
                                    <g id="Line-6" transform="translate(4.95 7.424)">
                                        <path id="Path_9913" data-name="Path 9913"
                                              d="M717.023,399.5a.773.773,0,0,1-.773-.773v-2.475a.773.773,0,1,1,1.547,0v2.475A.773.773,0,0,1,717.023,399.5Z"
                                              transform="translate(-716.25 -395.475)" fill="#2e84ff"/>
                                    </g>
                                    <g id="Line-7" transform="translate(0 4.95)">
                                        <path id="Path_9914" data-name="Path 9914"
                                              d="M711.5,393.022h-2.475a.773.773,0,1,1,0-1.547H711.5a.773.773,0,0,1,0,1.547Z"
                                              transform="translate(-708.25 -391.475)" fill="#2e84ff"/>
                                    </g>
                                    <g id="Line-8" transform="translate(7.424 4.95)">
                                        <path id="Path_9915" data-name="Path 9915"
                                              d="M723.5,393.022h-2.475a.773.773,0,0,1,0-1.547H723.5a.773.773,0,0,1,0,1.547Z"
                                              transform="translate(-720.25 -391.475)" fill="#2e84ff"/>
                                    </g>
                                </g>
                                <g id="Shape-2-2" data-name="Shape-2" transform="translate(9.913 5.419)">
                                    <path id="Path_9916" data-name="Path 9916"
                                          d="M732.563,299.413a25.8,25.8,0,0,0-8.88,5.626,26.168,26.168,0,0,0-1.845,1.977"
                                          transform="translate(-721.065 -298.639)" fill="#fff"/>
                                    <path id="Path_9917" data-name="Path 9917"
                                          d="M721.361,307.313a.774.774,0,0,1-.591-1.271,27.056,27.056,0,0,1,1.9-2.036,26.422,26.422,0,0,1,9.144-5.793.773.773,0,0,1,.545,1.448,24.893,24.893,0,0,0-8.614,5.457,25.464,25.464,0,0,0-1.792,1.92A.772.772,0,0,1,721.361,307.313Z"
                                          transform="translate(-720.588 -298.162)" fill="#2e84ff"/>
                                </g>
                                <g id="Union_3" data-name="Union 3" transform="translate(20.464 20.857)">
                                    <path id="Path_9918" data-name="Path 9918"
                                          d="M753.755,341.9l-5.943-5.944-5.943,5.944a1.891,1.891,0,0,1-2.674-2.675l5.94-5.943-5.94-5.943a1.891,1.891,0,1,1,2.674-2.675l5.943,5.943,5.943-5.943a1.891,1.891,0,0,1,2.674,0h0a1.891,1.891,0,0,1,0,2.674h0l-5.943,5.944,5.943,5.944a1.891,1.891,0,0,1,0,2.674h0a1.883,1.883,0,0,1-2.675,0Z"
                                          transform="translate(-738.023 -323.495)" fill="#e1ebff"/>
                                    <path id="Path_9919" data-name="Path 9919"
                                          d="M754.711,342.7a2.519,2.519,0,0,1-1.776-.741l-5.5-5.505-5.506,5.506a2.51,2.51,0,0,1-3.549-3.55l5.5-5.505-5.5-5.505a2.51,2.51,0,0,1,3.548-3.551l5.506,5.506,5.506-5.506a2.491,2.491,0,0,1,1.774-.736h0a2.51,2.51,0,0,1,1.776,4.284l-5.506,5.507,5.506,5.506a2.513,2.513,0,0,1-1.775,4.288Zm-7.28-8,6.383,6.383a1.3,1.3,0,0,0,1.8,0,1.272,1.272,0,0,0,0-1.8l-6.381-6.381,6.381-6.381a1.273,1.273,0,0,0-.9-2.173h0a1.264,1.264,0,0,0-.9.373l-6.381,6.381-6.381-6.381a1.273,1.273,0,0,0-1.8,1.8l6.377,6.38-6.376,6.38a1.272,1.272,0,1,0,1.8,1.8Z"
                                          transform="translate(-737.642 -323.114)" fill="#2e84ff"/>
                                </g>
                            </g>
                        </g>
                    </svg>
                    <p class="mt-6 mb-0">آیا از حذف دسترسی اطمینان دارید؟</p>
                </div>
                <div class="modal-footer justify-content-around border-0 pt-0">

                    <a class="btn btn-danger rounded-lg" href="{{ route('admin.permissions.destroy', $model) }}"
                       onclick="event.preventDefault();
                           document.getElementById('DeleteForm{{ $model }}').submit();"> حذف دسترسی
                    </a>
                    <form method="post" id="DeleteForm{{ $model }}"
                          action="{{ route('admin.permissions.destroy', $model) }}" class="d-none">
                        @csrf
                        <input type="hidden" name="_method" value="DELETE">
                    </form>
                    <button type="button" class="btn btn-outline-primary rounded-lg" data-bs-dismiss="modal">انصراف
                    </button>
                </div>
            </div>
        </div>
    </div>
    @break
    @case('adminFile')
    <div class="modal fade" id="Modal" data-backdrop="static" tabindex="-1" role="dialog"
         aria-labelledby="staticBackdrop"
         aria-hidden="true">
        <div class="modal-dialog modal-dialog-centered" role="document">
            <div class="modal-content rounded-lg">
                <div class="modal-body text-center">
                    <svg xmlns="http://www.w3.org/2000/svg" width="151.959" height="69.648"
                         viewBox="0 0 151.959 69.648">
                        <g id="delete" transform="translate(-710 -348.911)">
                            <g id="Group_1628" data-name="Group 1628" transform="translate(710 356.912)">
                                <g id="Background">
                                    <path id="Path_9855" data-name="Path 9855"
                                          d="M852.109,406.012a4.925,4.925,0,1,1,4.925,4.925A4.925,4.925,0,0,1,852.109,406.012Zm-109.748,4.925a4.925,4.925,0,0,1,0-9.849H714.925a4.925,4.925,0,0,1,0-9.849h28.141a4.925,4.925,0,0,0,0-9.849H725.477a4.925,4.925,0,0,1,0-9.849h28.141a4.925,4.925,0,1,1,0-9.849h40.1a4.925,4.925,0,1,1,0,9.849h45.025a4.925,4.925,0,1,1,0,9.849H854.22a4.925,4.925,0,1,1,0,9.849H840.853a4.925,4.925,0,1,0,0,9.849h4.221a4.925,4.925,0,0,1,0,9.849Z"
                                          transform="translate(-710 -361.691)" fill="#f3f7ff"/>
                                </g>
                                <g id="Oval-2" transform="translate(114.672 42.211)">
                                    <circle id="Ellipse_714" data-name="Ellipse 714" cx="2.111" cy="2.111" r="2.111"
                                            fill="#e1ebff"/>
                                </g>
                                <g id="Line_4" data-name="Line 4" transform="translate(17.295 7.599)">
                                    <path id="Path_9858" data-name="Path 9858"
                                          d="M749.255,414.017a.876.876,0,0,1-.622-.257l-1.489-1.489-1.489,1.489a.879.879,0,0,1-1.244-1.244l1.489-1.489-1.489-1.489a.879.879,0,0,1,1.244-1.244l1.489,1.489,1.489-1.489a.879.879,0,0,1,1.244,1.244l-1.489,1.489,1.489,1.489a.879.879,0,0,1-.622,1.5Z"
                                          transform="translate(-744.154 -408.037)" fill="#2e84ff"/>
                                </g>
                                <g id="Oval-3" transform="translate(127.336 4.925)">
                                    <circle id="Ellipse_715" data-name="Ellipse 715" cx="2.111" cy="2.111" r="2.111"
                                            fill="#e1ebff"/>
                                </g>
                            </g>
                            <g id="Shape-2" transform="translate(768.378 373.667)">
                                <path id="Path_9877" data-name="Path 9877"
                                      d="M822.132,386.218a3.968,3.968,0,1,1,3.968,3.968A3.968,3.968,0,0,1,822.132,386.218Zm-12.566,0a3.968,3.968,0,1,1,3.968,3.968A3.968,3.968,0,0,1,809.566,386.218Zm-12.566,0a3.968,3.968,0,1,1,3.968,3.968A3.968,3.968,0,0,1,797,386.218Z"
                                      transform="translate(-796.173 -381.423)" fill="#e1ebff"/>
                                <path id="Path_9878" data-name="Path 9878"
                                      d="M825.677,390.59a4.795,4.795,0,1,1,4.795-4.8A4.8,4.8,0,0,1,825.677,390.59Zm0-7.937a3.142,3.142,0,1,0,3.141,3.142A3.145,3.145,0,0,0,825.677,382.653Zm-12.566,7.937a4.795,4.795,0,1,1,4.795-4.8A4.8,4.8,0,0,1,813.111,390.59Zm0-7.937a3.142,3.142,0,1,0,3.142,3.142A3.145,3.145,0,0,0,813.111,382.653Zm-12.566,7.937a4.795,4.795,0,1,1,4.795-4.8A4.8,4.8,0,0,1,800.545,390.59Zm0-7.937a3.142,3.142,0,1,0,3.142,3.142A3.145,3.145,0,0,0,800.545,382.653Z"
                                      transform="translate(-795.75 -381)" fill="#3f9eff"/>
                            </g>
                            <g id="Line" transform="translate(757.341 367.92)">
                                <path id="Path_9879" data-name="Path 9879"
                                      d="M779.889,377.113a.827.827,0,0,1-.767-1.134,23.572,23.572,0,0,1,1.61-3.263.827.827,0,0,1,1.422.844,22.014,22.014,0,0,0-1.5,3.034A.826.826,0,0,1,779.889,377.113Z"
                                      transform="translate(-779.062 -372.311)" fill="#3f9eff"/>
                            </g>
                            <g id="Line-2" transform="translate(760.401 356.219)">
                                <path id="Path_9880" data-name="Path 9880"
                                      d="M784.515,366.223a.827.827,0,0,1-.653-1.333,29.746,29.746,0,0,1,10.943-8.74.827.827,0,0,1,.7,1.5A28.078,28.078,0,0,0,785.17,365.9.826.826,0,0,1,784.515,366.223Z"
                                      transform="translate(-783.689 -356.073)" fill="#3f9eff"/>
                            </g>
                            <g id="unsuccessful-payment" transform="translate(752.862 348.911)">
                                <g id="Shape">
                                    <path id="Path_9906" data-name="Path 9906"
                                          d="M755.867,342.316a24.01,24.01,0,0,1-3.608,2.873l4.636-3.939C756.582,341.6,756.235,341.959,755.867,342.316Zm2.782-3.092h0l-8.63,7.225a29.414,29.414,0,0,1-11.57,3.569,29.991,29.991,0,0,1-14.139-2.1,29.685,29.685,0,0,1-10.116-6.876,30.019,30.019,0,0,1-4.661-6.283,29.694,29.694,0,0,1,41.782-39.538,30.191,30.191,0,0,1,8.716,8.362A29.662,29.662,0,0,1,758.649,339.224Z"
                                          transform="translate(-705.036 -289.88)" fill="#fff"/>
                                    <path id="Path_9907" data-name="Path 9907"
                                          d="M735.217,350.441a30.9,30.9,0,0,1-11.671-2.29,30.263,30.263,0,0,1-10.381-7.055,30.48,30.48,0,0,1,7.082-47.868,30.466,30.466,0,0,1,31.009.856,30.6,30.6,0,0,1,7.522,45.151,37.849,37.849,0,0,1-8.855,7.412,30,30,0,0,1-11.874,3.662C737.108,350.4,736.162,350.441,735.217,350.441Zm-.189-59.492A28.922,28.922,0,0,0,709.739,333.9a29.241,29.241,0,0,0,4.54,6.121,28.731,28.731,0,0,0,9.854,6.7,29.331,29.331,0,0,0,13.773,2.049,28.467,28.467,0,0,0,11.2-3.439s2.806-1.874,4.935-3.656a33.909,33.909,0,0,0,3.582-3.473,29.047,29.047,0,0,0-22.6-47.252Z"
                                          transform="translate(-704.566 -289.403)" fill="#2e84ff"/>
                                </g>
                                <path id="Path_9908" data-name="Path 9908"
                                      d="M800.8,281.725v3.712a.773.773,0,1,1-1.547,0v-3.712"
                                      transform="translate(-714.702 -257.623)" fill="#2e84ff"/>
                                <g id="Line-2-2" data-name="Line-2" transform="translate(84.548 31.991)">
                                    <path id="Path_9909" data-name="Path 9909"
                                          d="M800.023,299.734a.773.773,0,0,1-.773-.773v-3.712a.773.773,0,0,1,1.547,0v3.712A.773.773,0,0,1,800.023,299.734Z"
                                          transform="translate(-799.25 -294.475)" fill="#2e84ff"/>
                                </g>
                                <g id="Line-3" transform="translate(78.361 29.516)">
                                    <path id="Path_9910" data-name="Path 9910"
                                          d="M793.736,292.022h-3.712a.773.773,0,0,1,0-1.547h3.712a.773.773,0,1,1,0,1.547Z"
                                          transform="translate(-789.25 -290.475)" fill="#2e84ff"/>
                                </g>
                                <g id="Line-4" transform="translate(87.023 29.516)">
                                    <path id="Path_9911" data-name="Path 9911"
                                          d="M807.736,292.022h-3.712a.773.773,0,1,1,0-1.547h3.712a.773.773,0,1,1,0,1.547Z"
                                          transform="translate(-803.25 -290.475)" fill="#2e84ff"/>
                                </g>
                                <g id="bling-2" transform="translate(2.279 58.202)">
                                    <g id="Line-5" transform="translate(4.95)">
                                        <path id="Path_9912" data-name="Path 9912"
                                              d="M717.023,387.5a.773.773,0,0,1-.773-.773v-2.475a.773.773,0,1,1,1.547,0v2.475A.773.773,0,0,1,717.023,387.5Z"
                                              transform="translate(-716.25 -383.475)" fill="#2e84ff"/>
                                    </g>
                                    <g id="Line-6" transform="translate(4.95 7.424)">
                                        <path id="Path_9913" data-name="Path 9913"
                                              d="M717.023,399.5a.773.773,0,0,1-.773-.773v-2.475a.773.773,0,1,1,1.547,0v2.475A.773.773,0,0,1,717.023,399.5Z"
                                              transform="translate(-716.25 -395.475)" fill="#2e84ff"/>
                                    </g>
                                    <g id="Line-7" transform="translate(0 4.95)">
                                        <path id="Path_9914" data-name="Path 9914"
                                              d="M711.5,393.022h-2.475a.773.773,0,1,1,0-1.547H711.5a.773.773,0,0,1,0,1.547Z"
                                              transform="translate(-708.25 -391.475)" fill="#2e84ff"/>
                                    </g>
                                    <g id="Line-8" transform="translate(7.424 4.95)">
                                        <path id="Path_9915" data-name="Path 9915"
                                              d="M723.5,393.022h-2.475a.773.773,0,0,1,0-1.547H723.5a.773.773,0,0,1,0,1.547Z"
                                              transform="translate(-720.25 -391.475)" fill="#2e84ff"/>
                                    </g>
                                </g>
                                <g id="Shape-2-2" data-name="Shape-2" transform="translate(9.913 5.419)">
                                    <path id="Path_9916" data-name="Path 9916"
                                          d="M732.563,299.413a25.8,25.8,0,0,0-8.88,5.626,26.168,26.168,0,0,0-1.845,1.977"
                                          transform="translate(-721.065 -298.639)" fill="#fff"/>
                                    <path id="Path_9917" data-name="Path 9917"
                                          d="M721.361,307.313a.774.774,0,0,1-.591-1.271,27.056,27.056,0,0,1,1.9-2.036,26.422,26.422,0,0,1,9.144-5.793.773.773,0,0,1,.545,1.448,24.893,24.893,0,0,0-8.614,5.457,25.464,25.464,0,0,0-1.792,1.92A.772.772,0,0,1,721.361,307.313Z"
                                          transform="translate(-720.588 -298.162)" fill="#2e84ff"/>
                                </g>
                                <g id="Union_3" data-name="Union 3" transform="translate(20.464 20.857)">
                                    <path id="Path_9918" data-name="Path 9918"
                                          d="M753.755,341.9l-5.943-5.944-5.943,5.944a1.891,1.891,0,0,1-2.674-2.675l5.94-5.943-5.94-5.943a1.891,1.891,0,1,1,2.674-2.675l5.943,5.943,5.943-5.943a1.891,1.891,0,0,1,2.674,0h0a1.891,1.891,0,0,1,0,2.674h0l-5.943,5.944,5.943,5.944a1.891,1.891,0,0,1,0,2.674h0a1.883,1.883,0,0,1-2.675,0Z"
                                          transform="translate(-738.023 -323.495)" fill="#e1ebff"/>
                                    <path id="Path_9919" data-name="Path 9919"
                                          d="M754.711,342.7a2.519,2.519,0,0,1-1.776-.741l-5.5-5.505-5.506,5.506a2.51,2.51,0,0,1-3.549-3.55l5.5-5.505-5.5-5.505a2.51,2.51,0,0,1,3.548-3.551l5.506,5.506,5.506-5.506a2.491,2.491,0,0,1,1.774-.736h0a2.51,2.51,0,0,1,1.776,4.284l-5.506,5.507,5.506,5.506a2.513,2.513,0,0,1-1.775,4.288Zm-7.28-8,6.383,6.383a1.3,1.3,0,0,0,1.8,0,1.272,1.272,0,0,0,0-1.8l-6.381-6.381,6.381-6.381a1.273,1.273,0,0,0-.9-2.173h0a1.264,1.264,0,0,0-.9.373l-6.381,6.381-6.381-6.381a1.273,1.273,0,0,0-1.8,1.8l6.377,6.38-6.376,6.38a1.272,1.272,0,1,0,1.8,1.8Z"
                                          transform="translate(-737.642 -323.114)" fill="#2e84ff"/>
                                </g>
                            </g>
                        </g>
                    </svg>
                    <p class="mt-6 mb-0">آیا از حذف فایل اطمینان دارید؟</p>
                </div>
                <div class="modal-footer justify-content-around border-0 pt-0">

                    <a class="btn btn-danger rounded-lg" href="{{ route('admin.file.delete', $model) }}"
                       onclick="event.preventDefault();
                           document.getElementById('DeleteForm{{ $model }}').submit();"> حذف فایل
                    </a>
                    <form method="post" id="DeleteForm{{ $model }}" action="{{ route('admin.file.delete', $model) }}"
                          class="d-none">
                        @csrf
                        <input type="hidden" name="_method" value="DELETE">
                    </form>
                    <button type="button" class="btn btn-outline-primary rounded-lg" data-bs-dismiss="modal">انصراف
                    </button>
                </div>
            </div>
        </div>
    </div>
    @break
    @default
@endswitch
